# Pandas

In [3]:
import pandas as pd # import Pandas to DS

In [3]:
data_frame = pd.DataFrame(data = { # DataFrame to do table for values
    'apple':[1,2,3],
    'oranges':[4,5,6]
})
print(type(data_frame))
data_frame # return [DataFrame]

<class 'pandas.core.frame.DataFrame'>

   apple  oranges
0      1        4
1      2        5
2      3        6

### Series with Intger

In [4]:
series1 = pd.Series([1,2,3]) # index values (Series)
print(type(series1))
print(series1) # return [Int 64]
print(series1[1]) # return [index value]

<class 'pandas.core.series.Series'>
0    1
1    2
2    3
dtype: int64
2

### Series with Float

In [5]:
series2 = pd.Series([1.1,2.2,3.3]) # index values (Series)
print(type(series2))
print(series2) # return [Float 64]
print(series2[1]) # return [index value]

<class 'pandas.core.series.Series'>
0    1.1
1    2.2
2    3.3
dtype: float64
2.2

### Series with string [object]

In [10]:
series3 = pd.Series(["a","b","c","d"]) # index values (Series)
print(type(series3))
print(series3) # return [object] and Int64
print(series3[1]) # return [index value]

<class 'pandas.core.series.Series'>
0    a
1    b
2    c
3    d
dtype: object
b

### Series with bool

In [7]:
series4 = pd.Series([5>2,False,True]) # index values (Series)
print(type(series4))
print(series4) # return [bool]
print(series4[1]) # return [index value]

<class 'pandas.core.series.Series'>
0     True
1    False
2     True
dtype: bool
False

In [15]:
data_frame = pd.DataFrame(data = { # DataFrame to do table for values
    'Int':series1,
    'Float':series2,
    'String':series3,
    'Bool':series4
})
print(type(data_frame))
data_frame # return [DataFrame]

<class 'pandas.core.frame.DataFrame'>

   Int  Float String   Bool
0  1.0    1.1      a   True
1  2.0    2.2      b  False
2  3.0    3.3      c   True
3  NaN    NaN      d    NaN

In [29]:
data_frame_courses = pd.DataFrame(data = {
    'math':[85,80,90],
    'python':[90,77,88],
    'sport':[93,85,78],
    'kimistry':[86,91,87]
}, index=['Rami','Shahd','Abood']) # Add names as index value
data_frame_courses.describe().transpose() # describe().transpose() For more readable and statistic sammary

          count       mean       std   min   25%   50%   75%   max
math        3.0  85.000000  5.000000  80.0  82.5  85.0  87.5  90.0
python      3.0  85.000000  7.000000  77.0  82.5  88.0  89.0  90.0
sport       3.0  85.333333  7.505553  78.0  81.5  85.0  89.0  93.0
kimistry    3.0  88.000000  2.645751  86.0  86.5  87.0  89.0  91.0

In [26]:
# Two ways to read coulmns from DataFrame
data_frame_courses.math
data_frame_courses['math']

Rami     85
Shahd    80
Abood    90
Name: math, dtype: int64

In [64]:
# Two ways to read rows from DataFrame
data_frame_courses.loc['Shahd'] # All rows
data_frame_courses.loc['Shahd'].math # one row
data_frame_courses.math.loc['Shahd'] # one row

80

## Read Files

### File Number 1

In [79]:
data_frame = pd.read_csv('../datasets/purchases.csv') # Read Excel Files 
data_frame.describe().transpose()

         count  mean        std   min    25%   50%    75%   max
apples     8.0  45.0  24.494897  10.0  27.50  45.0  62.50  80.0
oranges    8.0   4.5   2.449490   1.0   2.75   4.5   6.25   8.0

### File Number 2 movie data by IMDB

In [80]:
data_frame = pd.read_csv('../datasets/IMDB-Movie-Data.csv') # Read Excel Files 
data_frame.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Rank,1000.0,500.500000,288.819436,1.0,250.75,500.500,750.250,1000.00
Year,1000.0,2012.783000,3.205962,2006.0,2010.00,2014.000,2016.000,2016.00
Runtime (Minutes),1000.0,113.172000,18.810908,66.0,100.00,111.000,123.000,191.00
Rating,1000.0,6.723200,0.945429,1.9,6.20,6.800,7.400,9.00
Votes,1000.0,169808.255000,188762.647518,61.0,36309.00,110799.000,239909.750,1791916.00
Revenue (Millions),872.0,82.956376,103.253540,0.0,13.27,47.985,113.715,936.63
Metascore,936.0,58.985043,17.194757,11.0,47.00,59.500,72.000,100.00

In [70]:
print(data_frame.head()) # head def [Return : first five elements]
print('\n----------------DATA SCIENCE-----------------\n')
print(data_frame.head(3)) # head def [Return : first three elements]

     name  apples  oranges
0    June      10        1
1  Robert      20        3
2    Lily      30        4
3   David      40        7
4    rami      50        8

----------------DATA SCIENCE-----------------

     name  apples  oranges
0    June      10        1
1  Robert      20        3
2    Lily      30        4

In [69]:
print(data_frame.tail()) # tail def [Return : last five elements]
print('\n----------------DATA SCIENCE-----------------\n')
print(data_frame.tail(3)) # tail def [Return : last three elements]

     name  apples  oranges
3   David      40        7
4    rami      50        8
5   shahd      60        2
6   abood      70        5
7  waleed      80        6

----------------DATA SCIENCE-----------------

     name  apples  oranges
5   shahd      60        2
6   abood      70        5
7  waleed      80        6

## Times

In [93]:
import datetime
now = datetime.datetime.now()
print(now)
print(now.year)
print(now.month)
print(now.day)
print(now.strftime('%A'))
print(now.strftime('%b'))

2021-03-17 02:37:35.785138
2021
3
17
Wednesday
Mar
<class 'datetime.datetime'>